#include <iostream>

using namespace std;

int main()
{

	cout<<"****************************************\n欢迎来到欢乐斗地主游戏(字符版)！ Y(^_^)Y\n****************************************\n"<<endl;
	//欢迎词
	cout<<"现在是注册登陆阶段，请输入序号然后回车来进行操作：\n**********"<<endl;
	cout<<"1.注册帐号"<<endl;
	cout<<"2.登录帐号"<<endl;
	cout<<"3.匿名登录"<<endl;
	cout<<"4.离开游戏"<<endl;
	cout<<"**********\n>";
	//注册登录阶段

	cout<<"1"<<endl;
	//注册
	cout<<"\n请输入您要注册的用户名，然后回车：\n>";
	cout<<"lizhuoli"<<endl;
	cout<<"\n请输入您的密码，然后回车：\n>";
	cout<<"941126"<<endl;
	cout<<"\n请再次输入您的密码来确认：\n>";
	cout<<"941126"<<endl;
	//注册错误
	cout<<"\n两次输入的密码不一致，请重新输入：\n>";
	cout<<"\n该用户名已被注册，请换一个用户名重试\n";
	//注册成功
	cout<<"\n恭喜您注册成功，现在可以登录！\n"<<endl;

	//登录
	cout<<"\n请输入您的用户名：\n>";
	cout<<"lizhuoli"<<endl;
	cout<<"\n请输入您的密码：\n>";
	cout<<"941126"<<endl;

	//登录失败
	cout<<"\n用户名密码错误，请重新输入：\n>";
	cout<<"\n此帐号已登录，请稍候再试\n"<<endl;

	//准备阶段

	//登录成功
	cout<<"\n正在登录中…………\n\n您已成功登录啦，准备进入游戏(^O^)"<<endl;
	cout<<"\n现在在准备阶段，您可以输入以下字符然后回车来选择：\n"<<endl;
	cout<<"********************\nready：准备游戏\nuser：查看在线用户\nlogout：注销当前账户\n********************\n>";

	cout<<"ready"<<endl;
	//准备游戏
	cout<<"\n你已经准备游戏，正在等待其他人准备……"<<endl;

	//查看用户
	cout<<"\n当前用户："<<endl;

	//游戏开始
	cout<<"\n*************************************\n游戏开始啦，首先发牌并进行叫地主=^_^=\n*************************************"<<endl;


	//发牌
	cout<<"\n你的牌是：\n"<<endl;

	//叫地主
	cout<<"\n该你叫地主了，请输入：(y代表抢地主，n代表不抢)\n>";

	cout<<"y"<<endl;

	cout<<"\n等待他人叫地主中……\n"<<endl;

	//你是地主
	cout<<"\n恭喜，你是地主，现在补上3张底牌并且由你出牌\n"<<endl;
	//你不是地主
	cout<<"\n地主是：\n"<<endl;
	cout<<"等待地主出牌……"<<endl;

	//该你出牌
	cout<<"\n现在轮到你出牌了，请输入牌面下面的数字序号来出牌，用空格隔开多张牌：\n>";


	cout<<"1 3 6"<<endl;
	//出牌成功
	cout<<"\n成功出牌，等待他人出牌中……"<<endl;

	//出牌失败
	cout<<"你出的牌不符合规则，请重新出牌：\n>";

	cout<<"\n用户出了这些牌："<<endl;

	//展示手牌
	cout<<"\n你现在的牌：\n"<<endl;

	//不出牌
	cout<<"\n你跳过了出牌\n"<<endl;


	//胜利
	cout<<"\n*********************\n地主获得了胜利！\\^o^/\n*********************"<<endl;
	cout<<"\n*********************\n农民获得了胜利！\\^o^/\n*********************"<<endl;

	//再来一局
	cout<<"\n这局游戏结束了，想要再来一局吗？（输入y再来，n退出）\n>";

	//退出提示
	cout<<"\n******************************\n感谢您参与游戏，希望下次再来～\n******************************"<<endl;
}